/**
 * Created by zhoupan on 9/23/15.
 */
import javax.swing.JOptionPane;
public class question4 {
    public static void main(String[] args){
        int[] sign=new int[]{-1,-1};
        int k=0;
        String[][] check_1= new String[24][];
        String[][] check_2= new String[15][];
        check_1[0]=new String[]{"王      ","李      ","张\n","刘      ","陈      ","杨\n","周      ","黄      ","孙\n","吴      ","徐      ","赵\n","林      ","胡      ","朱\n"};
        check_1[1]=new String[]{"廖      ","萧      ","石\n","江      ","范      ","今\n","谭      ","邹      ","崔\n","薛      ","邱      ","康\n","史      ","候      ","邵\n"};
        check_1[2]=new String[]{"安      ","管      ","殷\n","霍      ","翟      ","佘\n","葛      ","庄      ","伍\n","辛      ","练      ","申\n","付      ","曲      ","焦\n"};
        check_1[3]=new String[]{"裴      ","商      ","初\n","屈      ","成      ","包\n","游      ","司      ","祁\n","强      ","靳      ","甘\n","席      ","瞿      ","卜\n"};
        check_1[4]=new String[]{"井      ","冀      ","邬\n","吉      ","敖      ","桑\n","池      ","简      ","蔺\n","连      ","艾      ","蓝\n","窦      ","刚      ","封\n"};
        check_1[5]=new String[]{"鞠      ","罡      ","未\n","来      ","劳      ","诸\n","计      ","乐      ","滑\n","双      ","花      ","冼\n","尉      ","水      ","丰\n"};
        check_1[6]=new String[]{"梁      ","郭      ","高\n","何      ","马      ","郑\n","罗      ","未      ","唐\n","谢      ","叶      ","韩\n","任      ","潘      ","于\n"};
        check_1[7]=new String[]{"熊      ","秦      ","雷\n","孟      ","庞      ","白\n","毛      ","赫      ","钱\n","段      ","俞      ","洪\n","汤      ","顾      ","贺\n"};
        check_1[8]=new String[]{"项      ","代      ","鲁\n","季      ","覃      ","金\n","毕      ","麦      ","阳\n","耿      ","舒      ","聂\n","盛      ","童      ","祝\n"};
        check_1[9]=new String[]{"褚      ","解      ","臧\n","时      ","费      ","班\n","华      ","全      ","涂\n","卓      ","党      ","饶\n","应      ","卫      ","丘\n"};
        check_1[10]=new String[]{"占      ","迟      ","姬\n","刁      ","栾      ","冷\n","杭      ","植      ","郁\n","晋      ","虞      ","佟\n","苑      ","屠      ","藏\n"};
        check_1[11]=new String[]{"寇      ","栗      ","况\n","干      ","楼      ","满\n","踘      ","湛      ","谌\n","储      ","邦      ","皮\n","楚      ","胥      ","明\n"};
        check_1[12]=new String[]{"冯      ","蒋      ","董\n","吕      ","邓      ","许\n","曹      ","曾      ","袁\n","汪      ","程      ","田\n","彭      ","钟      ","蔡\n"};
        check_1[13]=new String[]{"龚      ","伊      ","万\n","龙      ","赖      ","章\n","孔      ","武      ","刑\n","颜      ","梅      ","阮\n","黎      ","常      ","倪\n"};
        check_1[14]=new String[]{"柳      ","单      ","水\n","岳      ","骆      ","纪\n","欧      ","房      ","左\n","尤      ","凌      ","韦\n","景      ","詹      ","莫\n"};
        check_1[15]=new String[]{"隋      ","米      ","闵\n","畅      ","喻      ","冉\n","宫      ","甄      ","宣\n","穆      ","谈      ","匡\n","帅      ","车      ","母\n"};
        check_1[16]=new String[]{"蒙      ","经      ","辜\n","廉      ","巩      ","麻\n","晏      ","相      ","师\n","鄢      ","泮      ","燕\n","岑      ","官      ","仲\n"};
        check_1[17]=new String[]{"平      ","腾      ","厉\n","仉      ","励      ","竺\n","闻      ","宇      ","支\n","都      ","折      ","旷\n","南      ","战      ","稽\n"};
        check_1[18]=new String[]{"魏      ","沈      ","方\n","卢      ","余      ","杜\n","丁      ","苏      ","贾\n","姚      ","姜      ","陆\n","戴      ","傅      ","夏\n"};
        check_1[19]=new String[]{"施      ","乔      ","樊\n","严      ","齐      ","陶\n","向      ","温      ","文\n","易      ","兰      ","闫\n","芦      ","牛      ","尚\n"};
        check_1[20]=new String[]{"郎      ","路      ","宁\n","凤      ","关      ","丛\n","翁      ","容      ","亢\n","轲      ","鲍      ","蒲\n","苗      ","牟      ","谷\n"};
        check_1[21]=new String[]{"查      ","戚      ","符\n","繆      ","昌      ","娄\n","藤      ","位      ","奚\n","边      ","卞      ","桂\n","邝      ","苟      ","柏\n"};
        check_1[22]=new String[]{"羊      ","揭      ","仇\n","邸      ","宗      ","荆\n","盖      ","贲      ","梁\n","原      ","茅      ","荣\n","沙      ","郜      ","巫\n"};
        check_1[23]=new String[]{"化      ","糜      ","衣\n","国      ","逢      ","门\n","崇      ","裘      ","薄\n","束      ","宿      ","东\n","降      ","逯      ","伊\n"};
        check_2[0]=new String[]{"王    ","梁    ","冯    ","魏\n","廖    ","熊    ","龚    ","施\n","安    ","项    ","柳    ","郎\n","裴    ","褚    ","隋    ","查\n","井    ","占    ","蒙    ","羊\n","鞠    ","寇    ","平    ","化\n"};
        check_2[1]=new String[]{"李    ","郭    ","蒋    ","沈\n","萧    ","秦    ","伊    ","乔\n","管    ","代    ","单    ","路\n","商    ","解    ","米    ","戚\n","冀    ","迟    ","经    ","揭\n","罡    ","栗    ","腾    ","糜\n"};
        check_2[2]=new String[]{"张    ","高    ","董    ","方\n","石    ","雷    ","万    ","樊\n","殷    ","鲁    ","水    ","宁\n","除    ","臧    ","闵    ","符\n","邬    ","姬    ","辜    ","仇\n","未    ","况    ","厉    ","衣\n"};
        check_2[3]=new String[]{"刘    ","何    ","吕    ","卢\n","江    ","孟    ","龙    ","严\n","霍    ","季    ","岳    ","凤\n","屈    ","时    ","畅    ","繆\n","吉    ","刁    ","廉    ","邸\n","来    ","干    ","仉    ","国\n"};
        check_2[4]=new String[]{"陈    ","马    ","邓    ","余\n","范    ","庞    ","赖    ","齐\n","翟    ","覃    ","骆    ","关\n","成    ","费    ","喻    ","昌\n","敖    ","栾    ","巩    ","宗\n","劳    ","楼    ","励    ","逢\n"};
        check_2[5]=new String[]{"杨    ","郑    ","许    ","杜\n","今    ","白    ","章    ","陶\n","佘    ","金    ","纪    ","丛\n","包    ","班    ","冉    ","娄\n","桑    ","冷    ","麻    ","荆\n","诸    ","满    ","竺    ","门\n"};
        check_2[6]=new String[]{"周    ","罗    ","曹    ","丁\n","谭    ","毛    ","孔    ","向\n","葛    ","毕    ","欧    ","翁\n","游    ","华    ","宫    ","藤\n","池    ","杭    ","晏    ","盖\n","计    ","鞠    ","闻    ","崇\n"};
        check_2[7]=new String[]{"黄    ","未    ","曾    ","苏\n","邹    ","赫    ","武    ","温\n","庄    ","麦    ","房    ","容\n","司    ","全    ","甄    ","位\n","简    ","植    ","相    ","贲\n","乐    ","湛    ","宇    ","裘\n"};
        check_2[8]=new String[]{"孙    ","唐    ","袁    ","贾\n","崔    ","钱    ","刑    ","文\n","伍    ","阳    ","左    ","亢\n","祁    ","涂    ","宣    ","奚\n","蔺    ","郁    ","师    ","梁\n","滑    ","湛    ","支    ","薄\n"};
        check_2[9]=new String[]{"吴    ","谢    ","汪    ","姚\n","薛    ","段    ","颜    ","易\n","辛    ","耿    ","尤    ","柯\n","强    ","卓    ","穆    ","边\n","连    ","晋    ","鄢    ","原\n","双    ","储    ","都    ","东\n"};
        check_2[10]=new String[]{"徐    ","叶    ","程    ","姜\n","邱    ","俞    ","梅    ","兰\n","练    ","舒    ","凌    ","鲍\n","靳    ","党    ","谈    ","卞\n","艾    ","虞    ","泮    ","茅\n","花    ","邦    ","折    ","宿\n"};
        check_2[11]=new String[]{"赵    ","韩    ","田    ","陆\n","康    ","洪    ","阮    ","闫\n","申    ","聂    ","韦    ","浦\n","甘    ","饶    ","匡    ","桂\n","蓝    ","佟    ","燕    ","荥\n","冼    ","皮    ","旷    ","东\n"};
        check_2[12]=new String[]{"林    ","任    ","彭    ","戴\n","史    ","汤    ","黎    ","芦\n","付    ","盛    ","景    ","苗\n","席    ","应    ","帅    ","邝\n","窦    ","苑    ","岑    ","沙\n","尉    ","楚    ","南    ","降\n"};
        check_2[13]=new String[]{"胡    ","潘    ","钟    ","傅\n","侠    ","顾    ","常    ","牛\n","曲    ","童    ","詹    ","牟\n","瞿    ","卫    ","车    ","苟\n","刚    ","屠    ","官    ","郜\n","水    ","胥    ","战    ","逯\n"};
        check_2[14]=new String[]{"朱    ","于    ","蔡    ","夏\n","邵    ","贺    ","倪    ","尚\n","焦    ","祝    ","莫    ","谷\n","卜    ","丘    ","母    ","柏\n","封    ","藏    ","仲    ","巫\n","丰    ","明    ","嵇    ","伊\n"};
        for(int i=0;i<24;i++){
                int n = JOptionPane.showConfirmDialog(null, "You Last Name In Here ?\n" +check_1[i][0]+check_1[i][1]+check_1[i][2]+check_1[i][3]+check_1[i][4]+check_1[i][5]+check_1[i][6]+check_1[i][7]+check_1[i][8]+check_1[i][9]+check_1[i][10]+check_1[i][11]+check_1[i][12]+check_1[i][13]+check_1[i][14]);
                if (n == 0) {
                    sign[0] = i;
                    break;
                }
                else if(n==2){
                    break;
                }
        }
        if(sign[0]==-1){
            JOptionPane.showMessageDialog(null,"Sorry,Unable To Detect Your Last Name!");
            return;
        }
        for(int i=0;i<15;i++){
            int n=JOptionPane.showConfirmDialog(null,"You Name In Here ?\n"+check_2[i][0]+check_2[i][1]+check_2[i][2]+check_2[i][3]+check_2[i][4]+check_2[i][5]+check_2[i][6]+check_2[i][7]+check_2[i][8]+check_2[i][9]+check_2[i][10]+check_2[i][11]+check_2[i][12]+check_2[i][13]+check_2[i][14]+check_2[i][15]+check_2[i][16]+check_2[i][17]+check_2[i][18]+check_2[i][19]+check_2[i][20]+check_2[i][21]+check_2[i][22]+check_2[i][23]);
            if(n==0){
                sign[1]=i;
                break;
            }else if(n==2){
                break;
            }
        }
        JOptionPane.showMessageDialog(null,"You Last Name Is :"+check_2[sign[1]][sign[0]]);
    }
}
